import React from 'react';

const WhatsAppFloat = () => {
    return (
        <a 
            href="https://wa.me/584129295212?text=Hola,%20quiero%20información%20sobre%20sus%20servicios%20de%20seguridad" 
            target="_blank" 
            rel="noreferrer"
            className="whatsapp-float" 
            title="¡Escríbenos por WhatsApp!"
        >
            <div className="wa-tooltip">
                ¡Hola! ¿En qué podemos ayudarte?
            </div>
            
            <div className="wa-button">
                <div className="wa-notification">1</div>
                
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 32 32">
                    <path d="M16.004 0h-.008C7.174 0 0 7.184 0 16.032c0 3.5 1.132 6.744 3.054 9.378L1.056 31.29l6.122-1.606A15.94 15.94 0 0016 32.064h.004c8.82 0 16-7.182 16-16.03S24.824 0 16.004 0zm8.594 22.656c-.36 1.008-1.78 1.846-2.916 2.09-.776.164-1.79.294-5.202-.618-4.366-1.3-7.168-5.506-7.386-5.794-.214-.286-1.74-2.316-1.74-4.42s1.104-3.138 1.496-3.57c.392-.43.858-.538 1.146-.538.286 0 .572.002.822.012.264.01.618-.1.966.736.356.852 1.212 2.974 1.320 3.188.108.216.18.466.036.75-.144.288-.216.466-.432.71-.216.246-.454.548-.648.736-.244.24-.498.502-.214.984.284.482 1.264 2.078 2.714 3.368 1.866 1.662 3.44 2.176 3.892 2.418.452.242.716.202.978-.122.262-.322 1.124-1.31 1.424-1.76.3-.45.6-.374.982-.224.384.148 2.434 1.148 2.852 1.356.418.208.696.312.798.484.1.172.1.992-.242 1.998z"/>
                </svg>
            </div>
        </a>
    );
};

export default WhatsAppFloat;
